## Plan Result (915: sds_dev_ado - TerraformPlanApply)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.mi_adhoc_contributor[0]
* Update
  * azurerm_user_assigned_identity.azure-devops-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.mi_adhoc_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_adhoc_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "26f5a1bd-d791-4a08-9662-5babd1c3a903"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.Storage/storageAccounts/miadhoclandingdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.azure-devops-mi will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "azure-devops-mi" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/azure-devops-stg-mi"
        name                = "azure-devops-stg-mi"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/ado-shared-infra"
            "businessArea" = "Cross-Cutting"
          ~ "criticality"  = "High" -> "Low"
          ~ "environment"  = "staging" -> "development"
          - "startupMode"  = "always" -> null
        }
        # (5 unchanged attributes hidden)

      - timeouts {}
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 915: sds_dev_ado - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"","Target":"915: sds_dev_ado - TerraformPlanApply","Vars":{}} -->